app/Controllers/Members.php

    public function index()
    {
        $conn = db_connect();
        $model = new MembersPaginatedModel();
        $collegesModel = new CollegesModel($conn);

        $user = $_SESSION['user'];
        $user_role = $_SESSION['user_role'];
        $user_privileges = json_decode($user_role[0]['privileges'], true);
        $data = [];

        $data = [

            'members' => $model->where(['members.deleted_flag' => 0])
                                ->orderBy('members.member_id', 'ASC')
                                ->paginate(10),
---
SELECT *
FROM `members`
WHERE `members`.`deleted_flag` = 0
ORDER BY `members`.`member_id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `members`.`deleted_flag` = 0