app/Controllers/Users.php

SELECT *
FROM `user`
LEFT JOIN `role` ON `user`.`role_id` = `role`.`role_id`
WHERE `user`.`deleted_flag` = 0
AND `user`.`status` = 1
ORDER BY `user`.`user_id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `user`
LEFT JOIN `role` ON `user`.`role_id` = `role`.`role_id`
WHERE `user`.`deleted_flag` = 0
AND `user`.`status` = 1
---
    public function index()
    {
        $conn = db_connect();
        $model = new UsersPaginatedModel();
        $usersModel = new UsersModel($conn);
        $rolesModel = new RolesModel($conn);

        $user_data = $_SESSION['user'];


        $data = [];

        $data = [
            'users' => $model->where(['user.deleted_flag' => 0, 'user.status' => 1])
                                ->join('role', 'user.role_id = role.role_id', 'LEFT')
                                ->orderBy('user.user_id', 'ASC')
                                ->paginate(10),
            'roles' => $rolesModel->getRoles(),
            'pager' => $model->pager,
        ];