app/Models/CollegesModel.php

    public function getColleges()
    {
        return $this->conn->table($this->table)
                    ->where(['status' => 1, 'deleted_flag' => 0])
                    ->get()
                    ->getResult('array');
---
SELECT *
FROM `colleges`
WHERE `status` = 1
AND `deleted_flag` = 0