app/Models/MembersModel.php

    public function updateMemberPhoto($data, $id)
    {
        return $this->conn->table($this->table)
                            ->update($data, ['member_id' => $id]);
---
UPDATE `members` SET `photo` = '1692172813_4fee2a0fbef42475d794.jpg'
WHERE `member_id` = 'MB230727110145021'