app/Models/RolesModel.php

    public function getRoles()
    {
        return $this->conn->table($this->table)
                    ->where(['status' => 1, 'deleted_flag' => 0])
                    ->get()
                    ->getResult('array');
---
SELECT *
FROM `role`
WHERE `status` = 1
AND `deleted_flag` = 0

    public function getRole($id)
    {
        return $this->conn->table($this->table)
                    ->where(['role_id' => $id])
                    ->get()
                    ->getResult('array');
---
SELECT *
FROM `role`
WHERE `role_id` = 'RO230713095706987'